In [15]:
import random

In [4]:
from datetime import datetime

In [6]:
current_datetime = datetime.now()

In [11]:
filename = f"{current_datetime.year}-{current_datetime.month}-{current_datetime.day}-{current_datetime.hour}-{current_datetime.minute}-{current_datetime.second}"

In [12]:
filename

'2023-11-27-17-42-59'

In [1]:
import pandas as pd

In [6]:
df = pd.read_csv('../bird_data/bird_species.csv').set_index('species_no')

In [13]:
df[-1:]

                     scientific_name species_id
species_no
10982       gallus gallus domesticus   /m/09b5t

In [3]:
!pwd

/home/user/code/brunothormaehlen/birdies/notebooks

In [11]:
df.shape

(10982, 2)

In [41]:
nomber = random.randint(1, 10982)

In [43]:
type(nomber)

int

In [62]:
df[df.index == nomber]['scientific_name'].iloc[0]

'aquila chrysaetos'

In [28]:
df

                     scientific_name   species_id
species_no
1             lithoptila abdounensis  /m/0100hjcf
2             kurrartapu johnnguyeni  /m/010hmtwz
3                    zosterops kirki  /m/011l7vvz
4                  emberiza goslingi  /m/011py2_8
5           bambolinetta lignitifila  /m/01264yxh
...                              ...          ...
10978              aquila chrysaetos     /m/0m41v
10979                        mallard    /m/01hjj1
10980                     bald eagle     /m/01dx8
10981               struthio camelus     /m/05n4y
10982       gallus gallus domesticus     /m/09b5t

[10982 rows x 2 columns]

In [48]:
df2

species_no
10978    aquila chrysaetos
Name: scientific_name, dtype: object

In [70]:
random.uniform(0.5, 1)

0.8839537716045656

In [74]:
from datetime import datetime

In [78]:
now = datetime.now()

In [79]:
now

datetime.datetime(2023, 11, 28, 12, 12, 11, 70638)

In [83]:
now.strftime("%Y-%m-%d_%H-%M-%S")

'2023-11-28_12-12-11'

In [84]:
df

                     scientific_name   species_id
species_no
1             lithoptila abdounensis  /m/0100hjcf
2             kurrartapu johnnguyeni  /m/010hmtwz
3                    zosterops kirki  /m/011l7vvz
4                  emberiza goslingi  /m/011py2_8
5           bambolinetta lignitifila  /m/01264yxh
...                              ...          ...
10978              aquila chrysaetos     /m/0m41v
10979                        mallard    /m/01hjj1
10980                     bald eagle     /m/01dx8
10981               struthio camelus     /m/05n4y
10982       gallus gallus domesticus     /m/09b5t

[10982 rows x 2 columns]